Revit 2017 API
AssemblyViewUtils Class
 Utilities that provide capabilities related to assembly view creation and validation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2012
Syntax
C#
public static class AssemblyViewUtils
Visual Basic
Public NotInheritable Class AssemblyViewUtils
Visual C++
public ref class AssemblyViewUtils abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.AssemblyViewUtils
See Also
AssemblyViewUtils Members
Autodesk.Revit.DB Namespace